Repository: yevheniimoroziuk/openregistry.lots.loki
Catalog: docs/source/locale/*/LC_MESSAGES/tutorial.po
Languages: uk

source: Tutorial
uk: Туторіал

source: Exploring basic rules
uk: Базові правила

source: Just invoking it reveals empty set.
uk: При виклику видає пустий набір.

source: Now let's attempt creating a lot:
uk: Спробуймо створити новий лот

source: Error states that the only accepted Content-Type is `application/json`.
uk: Помилка вказує, що єдиний прийнятний тип вмісту це `application/json`.

source: Let's satisfy the Content-type requirement:
uk: Задовільнимо вимогу типу вмісту:

source: Error states that no `data` has been found in JSON body.
uk: Помилка вказує, що `data` не знайдено у тілі JSON.

source: Creating lot
uk: Створення лоту

source: Let's create lot with the minimal (only required) data set:
uk: Створимо лот з мінімально допустимим набором даних (тільки параметри обовязкові для заповнення) :

source: Success! Now we can see that new object was created. Response code is `201` and `Location` response header reports the location of the created object. The body of response reveals the information about the created lot: its internal `id` (that matches the `Location` segment), its official `lotID` and `dateModified` datestamp stating the moment in time when lot was last modified. Pay attention to the `lotType`. Note that lot is created with `verification` status.
uk: Успіх! Тепер ми бачимо, що новий об’єкт було створено. Код відповіді 201 та заголовок відповіді `Location` вказує місцерозташування створеного об’єкта. Тіло відповіді показує інформацію про створений лот, його внутрішнє `id` (яке співпадає з сегментом `Location`), його офіційне `lotID` та `dateModified` дату, що показує час, коли лот востаннє модифікувався. Зверніть увагу на те, що лот створений в статусі `verification`.

source: Let's access the URL of the created object (the `Location` header of the response):
uk: Використаємо URL створеного об’єкта (заголовок відповіді `Location`):

source: We can see the same response we got after creating lot.
uk: Ми бачимо ту ж відповідь, що і після створення лоту.

source: Let's see what listing of lots reveals us:
uk: Подивимось, що показує список лотів:

source: The previous lot contained only required fields. Let's try creating lot with more data (lot has status `created`):
uk: Попередній лот був створений лише з обов’язковими полями. Тепер додамо лот з максимально допустимим набором даних при створенні (лот повинен бути у статусі 'created'):

source: Let's check what lot registry contains:
uk: Перевіримо, що містить реєстр:

source: And indeed we have 2 lots now.
uk: Дійсно, в нас зараз є два лоти.

source: Modifying Lot
uk: Модифікація лоту

source: Let's update lot description:
uk: Оновимо лот шляхом надання йому усіх інших важливих властивостей:

source: Checking the listing again reflects the new modification date:
uk: Ще одна перевірка списку відображає нову дату модифікації:

source: Deleting Lot
uk: Видалення лоту

source: Let's delete lot:
uk: Видалимо лот

source: Integration with assets
uk: Інтеграція з активами

source: We do see the internal `id` of the lot (that can be used to construct full URL by prepending `https://lb.api-sandbox.registry.ea.openprocurement.net/api/0.1/lots/`) and its `dateModified` datestamp.
uk: Ми бачимо внутрішнє `id` лоту (що може бути використано для побудови повної URL-адреси, якщо додати `https://lb.api-sandbox.registry.ea.openprocurement.net/api/0.1/lots/` та його dateModified дату.

source: And again we have `201 Created` response code, `Location` header and body with extra `id`, `lotID`, and `dateModified` properties.
uk: І знову код відповіді `201 Created`, заголовок Location і тіло з додатковим `id`, `lotID` та властивість `dateModified`.

source: We see the added properies have merged with existing lot data. Additionally, the `dateModified` property was updated to reflect the last modification datestamp.
uk: Ми бачимо, що додаткові властивості об’єднані з існуючими даними лоту. Додатково оновлена властивість `dateModified`, щоб відображати останню дату модифікації.

source: Let's try exploring the `/lots` endpoint:
uk: Подивимось як працює точка входу `/lots`:

source: Concierge operations
uk: Зв'язок реєстру лотів з реєстром активів

source: Convoy operations
uk: За'язок ЦБД з RDB

source: When the procedure is successfully created, lot status will be changed to `active.auction`:
uk: Якщо в ЦБД процедура успішно створена, в RDB статус лота змінюється на `active.auction`:

source: After lot has been sold in the auction, its status is turned to `sold` within RDB:
uk: Якщо в заведеній процедурі лот було продано, його статус в RDB змінюється на `sold`:

source: In case of that lot has not been sold, its status will be changed to `active.salable` in RDB:
uk: У випадку, якщо лот залишився некупленим, його статус повертається у `active.auction`, стаючи знову доступним до виставлення на торги:

source: Assume that we have lot in `active.salable` status and we want to modify this lot. For such purposes `recomposed` status exists.
uk: У разі, якщо зміни потрбіно внести у вже сформований лот (статус `active.salable`), Ліквідатору необхідно перевести статус цього лоту в `recomposed`

source: After some checks have been done, lot status will be switched to `pending` automatically.
uk: Опісля, його статус автоматично буде змінений на `pending`.

source: For lot to be formed, you need to specify some id of the assets to be included in that lot. If all of the assets are available, they will be attached to lot and status will be changed to `active.salable`:
uk: Для того, аби сформувати лот, необхідно вказати id активів, які Ви хочете прикріпити до лоту. Якщо всі вказані Вами активи доступні, статус лоту зміниться на `active.salable`:

source: In case of at least one of the assets is unavailable (e.g. it has already been attached to another lot), status of the current one will be turned to `pending`:
uk: У випадку, якщо хоча б один із зазначених активів виявився недоступним (напр. цей актив вже прикріплений до іншого лоту), статус поточного лоту буде змінено на `pending`:

source: When bot finds that status of lot is `pending.dissolution`, it turns status of the assets being attached to that lot to `pending`. Status of the lot itself will become `dissolved`.
uk: У разі, якщо лот перебуває у статусі `pending.dissolution`, бот відкріплює причеплені до цього лоту активи, відтак їхні статуси змінюються на `pending`. Статус самого лоту автоматично стає `dissolved`.

source: When bot finds that status of lot is `recomposed`, it turns status of the assets being attached to that lot to `pending`. Status of the lot itself becomes `pending` as well.
uk: У разі, якщо лот перебуває у статусі `recomposed`, бот відкріплює причеплені до цього лоту активи, відтак їхні статуси змінюються на `pending`. Статус самого лоту автоматично стає `pending`.

source: When lot is finally formed (`active.saleable`) it can be used in the procedure within CDB. For this to be done, you need to specify lot id. By doing this, you will find the `merchandisingObject` field with the current lot id in the created procedure and id of the auction within which it is going to be sold. Status of the lot used will be automatically changed to `active.awaiting` in RDB. This indicates that Organizer is creating some auction with this lot within CDB, so it is currently unavailable for usage.
uk: Після того, як лот сформований (`active.saleable`), він стає доступним до виставлення на торги в ЦБД. Аби завести процедуру по певному лоту, необхідно вказати його lot id. Виконавши це, у процедурі з'явиться поле `merchandisingObject`, у якому значитиметься id поточного лоту, а також вказуватиметься id аукціону, у якому продаватиметься цей лот. В Реєстрі статус лоту з яким ви працюєте зміниться на `active.awaiting`, що ідентифікуватиме процес заведення процедури по цьому лоту в ЦБД, а також те, що він стає недоступним для використання в інших процедурах.

source: After lot has been sold in the auction, its status is turned to `pending.sold` within RDB:
uk: Якщо в заведеній процедурі лот було продано, його статус в RDB змінюється на `sold`:

source: When bot finds that status of lot is `pending.sold`, it turns status of the assets being attached to that lot to `complete`. Status of the lot itself turns to `sold`.
uk: У разі, якщо лот перебуває у статусі `pending.sold`, бот змінює статус активів, що були причеплені до цього лоту на `complete`, змінюючи статус самого лоту на `sold`.
